# IFC_DMSaveSettings

## Description
Saves current IFC Data Mapping. If bFileSettings is set to FALSE, setting will be saved only for indicated Object.

```pascal
FUNCTION IFC_DMSaveSettings(
				inStrParam    : STRING;
				inObjName     : STRING;
				bFileSettings : BOOLEAN): BOOLEAN;
```

```python
def vs.IFC_DMSaveSettings(inStrParam, inObjName, bFileSettings):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrParam|STRING|The name which the IFC Data Mapping will be saved with.|
|inObjName|STRING|Object name.|
|bFileSettings|BOOLEAN|TRUE if the user wants to save the whole IFC Data Mapping. FALSE - saves only the specified Object's mapping.|

## Examples
#### VectorScript ####
```pascal
PROCEDURE Test;
VAR
	ok : BOOLEAN;
BEGIN
	ok := IFC_DMSaveSettings('MyIFCMapping', '', TRUE);
END;

RUN(Test);
```
#### Python ####
```python
ok = vs.IFC_DMSaveSettings('MyIFCMapping', '', TRUE)
```

```pascal
resultOK := IFC_DMSaveSettings('Example', 'Example', TRUE);
```
```python
import vs

# Saves current IFC Data Mapping.
inStrParam = 'Example'
inObjName = 'Example'
bFileSettings = True

ok = vs.IFC_DMSaveSettings(inStrParam, inObjName, bFileSettings)
if ok:
    vs.Message('IFC_DMSaveSettings succeeded')
else:
    vs.Message('IFC_DMSaveSettings failed')
```

## Version
Available from: Vectorworks 2017

## Category
* IFC